In [185]:
import pandas as pd
import matplotlib.pyplot as plt

# Plt stye
plt.style.use("fivethirtyeight")

# Data Frame
df = pd.read_csv(r"D:\Python Course\Exercise Pt3\csv\car_data.csv")

In [186]:
# First 10 data
first10 = df.head(10)
first10

,CarID,Brand,Model,Year,Price,Mileage,FuelType,Transmission,Region
0,C001,Mitsubishi,Outlander,2021,23795,131932,Electric,Manual,Bandung
1,C002,Hyundai,i20,2022,52732,54886,Petrol,Automatic,Bandung
2,C003,BMW,X3,2017,45194,87498,Diesel,Automatic,Makassar
3,C004,BMW,X5,2022,68788,16023,Electric,Manual,Medan
4,C005,Honda,Accord,2017,9685,64820,Electric,Automatic,Denpasar
5,C006,BMW,3 Series,2016,67735,64925,Hybrid,Automatic,Medan
6,C007,Mitsubishi,Pajero,2020,10433,5311,Diesel,Automatic,Denpasar
7,C008,Suzuki,Baleno,2019,25568,85305,Petrol,Manual,Makassar
8,C009,Hyundai,Elantra,2020,14396,130608,Diesel,Automatic,Bandung
9,C010,Tesla,Model S,2017,9899,56886,Hybrid,Automatic,Denpasar

In [187]:
# Show Cars Price > 30000 & < 10000 mileage
carsDat1 = df[["CarID","Brand", "Model","Year","FuelType","Transmission"]][(df["Price"] > 30000 ) & (df["Mileage"] < 10000)]

carsDat1

   CarID       Brand      Model  Year FuelType Transmission
19  C020       Tesla    Model 3  2018   Petrol       Manual
47  C048         BMW         X5  2023   Hybrid       Manual
53  C054      Suzuki      Swift  2023   Diesel       Manual
83  C084  Mitsubishi  Outlander  2021   Petrol    Automatic
88  C089      Toyota      Camry  2015   Petrol    Automatic

In [188]:
# Show all car brands (unique)
brands = df["Brand"].unique()
print(brands)

['Mitsubishi' 'Hyundai' 'BMW' 'Honda' 'Suzuki' 'Tesla' 'Toyota']

In [189]:
# Count Cars for each fuel type
carFuelType = df["FuelType"].value_counts()
carFuelType

FuelType
Hybrid      35
Diesel      25
Petrol      22
Electric    18
Name: count, dtype: int64

In [190]:
# top5 expenive cars on data
top5 = df.sort_values(by="Price" ,ascending=False).head(5)
top5

,CarID,Brand,Model,Year,Price,Mileage,FuelType,Transmission,Region
93,C094,Suzuki,Ertiga,2017,69135,50108,Petrol,Manual,Surabaya
56,C057,Suzuki,Baleno,2020,69087,68840,Electric,Manual,Medan
3,C004,BMW,X5,2022,68788,16023,Electric,Manual,Medan
86,C087,Honda,Civic,2020,68535,59040,Petrol,Automatic,Medan
60,C061,Honda,Accord,2015,68343,93264,Petrol,Manual,Medan

In [191]:
# Avg price per Brand (High - Low)
avgBrand = round(df.groupby("Brand")["Price"].mean().sort_values(ascending=False), 2)
avgBrand

Brand
Hyundai       46746.15
BMW           45076.50
Honda         43355.00
Suzuki        41031.84
Toyota        38021.14
Tesla         33631.08
Mitsubishi    33348.64
Name: Price, dtype: float64

In [192]:
# Common Car Mode Sold
ommModel = df["Model"].value_counts().head(1)

In [193]:
# Count Car Sold w/ Manual Transmission
manual =(df["Transmission"] == "Manual").sum()
print(manual)

50

In [194]:
# Electric Car Sold in Bandung
elBandung = df[(df["FuelType"] == "Electric") & (df["Region"] == "Bandung")]
elBandung

,CarID,Brand,Model,Year,Price,Mileage,FuelType,Transmission,Region
0,C001,Mitsubishi,Outlander,2021,23795,131932,Electric,Manual,Bandung
20,C021,Toyota,Camry,2016,14873,37065,Electric,Manual,Bandung

In [195]:
# Count Sold per Region
soldReg = df["Region"].value_counts()
soldReg

Region
Bandung     23
Makassar    20
Medan       19
Denpasar    14
Jakarta     13
Surabaya    11
Name: count, dtype: int64

In [196]:
# Oldest Car Sold (Year)
df.sort_values(by="Year", ascending=True).head(1)

   CarID    Brand Model  Year  Price  Mileage FuelType Transmission   Region
28  C029  Hyundai  Kona  2015  56984    40774   Diesel       Manual  Jakarta

In [202]:
# Create New Column for CarAge (based 2025)
age = 2025 - df["Year"]
# df.insert(6, "CarAge", age)

In [212]:
# Average Mileage by Transmission
avgmile = df.groupby("Transmission")["Mileage"].mean().sort_values(ascending=False)
avgmile

Transmission
Automatic    71462.24
Manual       67445.68
Name: Mileage, dtype: float64

In [218]:
# Top 5 Cheapest Car each Brand
cheapCar = df.groupby("Brand")["Price"].min().sort_values(ascending=True).head(5)
cheapCar

Brand
Hyundai        8854
Mitsubishi     9585
Honda          9685
Tesla          9802
Suzuki        11556
Name: Price, dtype: int64

In [226]:
# Total Revenue Car Sold in Jakarta
JktRev = (df["Price"][df["Region"] == "Jakarta"].sum())
print(JktRev)

424739

In [228]:
df.to_csv(r"D:\Python Course\Exercise Pt3\csv\newCarData.csv", index=False)